      01 some.
           03 other.
              05 l5-0.
                 06 l6          pic x.
              05 l5-1.
                 07 l7-1.
                    09 l9-1     PIC X(01).
                    09 l9-2     PIC X(03).
                 07 l7-2        PIC 9(02).
              05 l5-2           PIC X(03).
              05 l5-3           PIC X(03).
                   88 l88-1     VALUE SPACES.
                   88 l88-2     VALUE "stuff".